package by.anton.exercises.chapter_4.Exercise_4_2;

/**
 * Created by Buben_AV on 16.05.2017.
 *
 */
public class Exercise_4_2 {
    /**
     * Task for the exercise 4_2
     */
    private final String TASK = "Создать приложение, удовлетворяющее требованиям, приведенным в зада-\n" +
            "нии. Наследование применять только в тех заданиях, в которых это логически\n" +
            "обосновано. Аргументировать принадлежность классу каждого создаваемого\n" +
            "метода и корректно переопределить для каждого класса методы equals(),\n" +
            "hashCode(), toString()." +
            "Создать объект класса Государство, используя классы Область, Район,\n" +
            "Город. Методы: вывести на консоль столицу, количество областей, площадь, областные центры.";

    /**
     * This is a constructor to run the exercise 4_2
     */
    public Exercise_4_2() {

    }
}
